In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path=r'C:\Users\jinu5\Desktop\careerfoundry\Achivement 4\Instacart Basket Analysis_2024-01-02'

In [3]:
ords_prods_merge=pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge.pkl'))

In [4]:
df_customers= pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'customers.csv'), index_col = False)

### Step 4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [5]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [14]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Last Name     206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int8
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int8
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int32
dtypes: int32(1), int64(1), int8(2), object(6)
memory usage: 12.2+ MB

In [13]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    int32
 2   order_number               int8
 3   order_day_of_week          int8
 4   order_hour_of_day          int8
 5   days_since_previous_order  float16
 6   product_id                 int32
 7   add_to_cart_order          int32
 8   reordered                  int32
 9   product_name               object
 10  aisle_id                   int8
 11  department_id              int32
 12  prices                     float64
 13  price_range_loc            object
 14  busiest_day                object
 15  busiest_days               object
 16  busiest_period_of_day      object
 17  max_order                  int8
 18  loyalty_flag               object
 19  average_spending           float64
 20  spending_flag              object
 21  order_frequency            float16
 22  frequency_flag             object
dtypes: float16(2), float64(2), int32(6), int8(5), object(8)
memory usage: 3.4+ GB

In [5]:
# rename the column '
df_customers.rename(columns ={'Surnam' : 'Last Name'}, inplace=True)

In [6]:
# changing data type
df_customers['Age'] = df_customers['Age'].astype('int8')
df_customers['n_dependants'] = df_customers['n_dependants'].astype('int8')
df_customers['income'] = df_customers['income'].astype('int32')

In [8]:
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [ ]:
Step 5. Complete the fundamental data quality and consistency checks

#### 1) missing values

In [10]:
df_customers.isnull().sum()

user_id             0
First Name      11259
Last Name           0
Gender              0
STATE               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [16]:
# Creating new dataframe which have null records in First Name
cu_null=df_customers[df_customers['First Name'].isnull() == True]

In [17]:
cu_null

,user_id,First Name,Last Name,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

In [18]:
cu_null.describe()

             user_id           Age  n_dependants         income
count   11259.000000  11259.000000  11259.000000   11259.000000
mean   102498.714895     49.336797      1.503686   94079.482192
std     59524.324166     18.557772      1.126664   42411.625779
min        61.000000     18.000000      0.000000   25937.000000
25%     50645.500000     33.000000      0.000000   58899.500000
50%    103345.000000     49.000000      2.000000   92983.000000
75%    154024.500000     65.000000      3.000000  123968.500000
max    206204.000000     81.000000      3.000000  592409.000000

####  The records having missing values in First Name are indentified that they have no missing values in User_id and other variables.<br>I keep and not impute the records having missing values in First Name.

#### 2) duplication

In [20]:
duplicated=df_customers.duplicated()

In [21]:
duplicated

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

#### No duplicated data

#### 3) mixed-type data

In [22]:
# check for columns that have mixed data type
for col in df_customers.columns.tolist():
    weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
    
    if len (df_customers[weird]) > 0:
        print (col)

First Name

In [9]:
# changing data type
df_customers['First Name'] = df_customers['First Name'].astype('str')

In [10]:
# check again
for col in df_customers.columns.tolist():
    weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
    
    if len (df_customers[weird]) > 0:
        print (col)
    else: print ("no mexed-type data.")

no mexed-type data.
no mexed-type data.
no mexed-type data.
no mexed-type data.
no mexed-type data.
no mexed-type data.
no mexed-type data.
no mexed-type data.
no mexed-type data.
no mexed-type data.

### Step 6. combine customer data to ords_prods_merge

In [11]:
ords_prods_merge=ords_prods_merge.drop(columns ='_merge')

In [12]:
# merge dataframe by using key as user_id
insta_cleaned=ords_prods_merge.merge(df_customers, on = 'user_id', indicator=True)

In [14]:
insta_cleaned.shape

(32404859, 33)

In [15]:
insta_cleaned.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_previous_order,product_id,add_to_cart_order,reordered,product_name,...,First Name,Last Name,Gender,STATE,Age,date_joined,n_dependants,fam_status,income,_merge
0,2539329,1,1,2,8,0.0,196,1,0,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [16]:
insta_cleaned['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [17]:
# missing value check
insta_cleaned.isnull().sum()

order_id                     0
user_id                      0
order_number                 0
order_day_of_week            0
order_hour_of_day            0
days_since_previous_order    0
product_id                   0
add_to_cart_order            0
reordered                    0
product_name                 0
aisle_id                     0
department_id                0
prices                       0
price_range_loc              0
busiest_day                  0
busiest_days                 0
busiest_period_of_day        0
max_order                    0
loyalty_flag                 0
average_spending             0
spending_flag                0
order_frequency              0
frequency_flag               0
First Name                   0
Last Name                    0
Gender                       0
STATE                        0
Age                          0
date_joined                  0
n_dependants                 0
fam_status                   0
income                       0
_merge                       0
dtype: int64

In [18]:
insta_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 33 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    int32
 2   order_number               int8
 3   order_day_of_week          int8
 4   order_hour_of_day          int8
 5   days_since_previous_order  float16
 6   product_id                 int32
 7   add_to_cart_order          int32
 8   reordered                  int32
 9   product_name               object
 10  aisle_id                   int8
 11  department_id              int32
 12  prices                     float64
 13  price_range_loc            object
 14  busiest_day                object
 15  busiest_days               object
 16  busiest_period_of_day      object
 17  max_order                  int8
 18  loyalty_flag               object
 19  average_spending           float64
 20  spending_flag              object
 21  order_frequency            float16
 22  frequency_flag             object
 23  First Name                 object
 24  Last Name                  object
 25  Gender                     object
 26  STATE                      object
 27  Age                        int8
 28  date_joined                object
 29  n_dependants               int8
 30  fam_status                 object
 31  income                     int32
 32  _merge                     category
dtypes: category(1), float16(2), float64(2), int32(7), int8(7), object(14)
memory usage: 5.1+ GB

In [19]:
insta_cleaned=insta_cleaned.drop(columns ='_merge')

In [20]:
insta_cleaned['average_spending']=insta_cleaned['average_spending'].astype('float16')

### Export dataframe

In [21]:
insta_cleaned.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'insta_cleaned.pkl'))